const date = {
  "01-01": [
    { "year": "1912", "title": "中华民国成立" },
    { "year": "1999", "title": "欧元正式启用" }
  ],
  "02-04": [
    { "year": "1861", "title": "美国南北战争爆发" },
    { "year": "1975", "title": "刘家峡水电站建成" }
  ],
  "02-05": [
    { "year": "1912", "title": "民国政府统一货币" },
    { "year": "1964", "title": "我国第一例自体肾移植手术成功" }
  ],
  "02-06": [
    { "year": "1908", "title": "上海首次试行有轨电车" },
    { "year": "1952", "title": "英国国王乔治六世逝世" }
  ],
  "02-07": [
    { "year": "1477", "title": "勃艮第战争结束" },
    { "year": "1974", "title": "我国海洋科学考察船首次出海" }
  ],
  "02-08": [
    { "year": "1902", "title": "梁启超在日本创办《新民丛报》" },
    { "year": "1979", "title": "中共中央批准为右派分子平反" }
  ],
  "02-09": [
    { "year": "1825", "title": "俄国十二月党人起义失败" },
    { "year": "1928", "title": "夏明翰就义" }
  ],
  "02-10": [
    { "year": "1763", "title": "巴黎和约签订，七年战争结束" },
    { "year": "1964", "title": "龙羊峡水电站开工" }
  ],
  "02-11": [
    { "year": "1878", "title": "《圣斯特凡诺条约》签订" },
    { "year": "1963", "title": "中央美术学院成立" }
  ],
  "02-12": [
    { "year": "1809", "title": "林肯出生" },
    { "year": "1912", "title": "清宣统皇帝溥仪宣布退位" }
  ],
  "02-13": [
    { "year": "1895", "title": "甲午战争清政府战败" },
    { "year": "1980", "title": "中国首次派团参加冬季奥运会" }
  ],
  "02-14": [
    { "year": "1876", "title": "亚历山大·格拉汉姆·贝尔申请电话专利" },
    { "year": "1912", "title": "聂耳出生" }
  ],
  "02-15": [
    { "year": "1564", "title": "伽利略出生" },
    { "year": "1904", "title": "华兴会成立" }
  ],
  "02-16": [
    { "year": "1910", "title": "同盟会分裂" },
    { "year": "1959", "title": "古巴革命胜利" }
  ],
  "02-17": [
    { "year": "1616", "title": "努尔哈赤建立后金" },
    { "year": "1963", "title": "迈克尔·乔丹出生" }
  ],
  "02-18": [
    { "year": "1294", "title": "元世祖忽必烈逝世" },
    { "year": "1861", "title": "意大利王国宣布成立" }
  ],
  "02-19": [
    { "year": "1473", "title": "哥白尼出生" },
    { "year": "2008", "title": "科索沃宣布独立" }
  ],
  "02-20": [
    { "year": "1881", "title": "奥地利作家卡夫卡出生" },
    { "year": "1985", "title": "我国首次南极科考凯旋" }
  ],
  "02-21": [
    { "year": "1848", "title": "《共产党宣言》出版" },
    { "year": "1972", "title": "美国总统尼克松访华" }
  ],
  "02-22": [
    { "year": "1732", "title": "华盛顿出生" },
    { "year": "1921", "title": "考茨基逝世" }
  ],
  "02-23": [
    { "year": "1868", "title": "美国通过宪法第14修正案" },
    { "year": "1940", "title": "杨靖宇壮烈牺牲" }
  ],
  "02-24": [
    { "year": "1881", "title": "沙俄强迫清政府签订《伊犁条约》" },
    { "year": "1991", "title": "海湾战争结束" }
  ],
  "02-25": [
    { "year": "1841", "title": "鸦片战争中清军反攻失败" },
    { "year": "1994", "title": "约旦与以色列建交" }
  ],
  "02-26": [
    { "year": "1808", "title": "法国进攻西班牙" },
    { "year": "1985", "title": "我国第一台大型电子显微镜研制成功" }
  ],
  "02-27": [
    { "year": "1844", "title": "多米尼加独立" },
    { "year": "1999", "title": "奥巴桑乔当选尼日利亚总统" }
  ],
  "12-31": [
    { "year": "1916", "title": "袁世凯复辟帝制失败" },
    { "year": "1946", "title": "中国开始使用公历" }
  ]
};