const date = {
  "01-01": [
    { "year": "1912", "title": "中华民国成立" },
    { "year": "1999", "title": "欧元正式启用" }
  ],
  "01-02": [
    { "year": "1905", "title": "日俄战争爆发" },
    { "year": "1923", "title": "《中国国民党党纲》公布" }
  ],
  "01-03": [
    { "year": "1521", "title": "麦哲伦抵达关岛" },
    { "year": "1989", "title": "长江葛洲坝水利枢纽工程竣工" }
  ],
  "01-04": [
    { "year": "1917", "title": "胡适发起文学改良运动" },
    { "year": "1948", "title": "缅甸独立" }
  ],
  "01-05": [
    { "year": "1919", "title": "纳粹党成立" },
    { "year": "1930", "title": "毛泽东撰写《星星之火，可以燎原》" }
  ],
  "01-06": [
    { "year": "1374", "title": "明朝《大明律》颁布" },
    { "year": "1941", "title": "皖南事变" }
  ],
  "01-07": [
    { "year": "1558", "title": "法国加来城沦陷" },
    { "year": "1933", "title": "中共临时中央迁入中央苏区" }
  ],
  "01-08": [
    { "year": "1902", "title": "梁启超创办《新民丛报》" },
    { "year": "1976", "title": "周恩来逝世" }
  ],
  "01-09": [
    { "year": "1283", "title": "文天祥就义" },
    { "year": "1946", "title": "中国代表参加远东委员会" }
  ],
  "01-10": [
    { "year": "1861", "title": "佛罗里达州宣布退出联邦" },
    { "year": "1946", "title": "第一届联合国大会第一期会议举行" }
  ],
  "01-11": [
    { "year": "1851", "title": "金田起义爆发" },
    { "year": "1947", "title": "刘胡兰就义" }
  ],
  "01-12": [
    { "year": "1791", "title": "大英博物馆对外开放" },
    { "year": "1920", "title": "土耳其废除素丹制" }
  ],
  "01-13": [
    { "year": "1908", "title": "中、英、德签订《津浦铁路借款合同》" },
    { "year": "1958", "title": "九千岁宫建成" }
  ],
  "01-14": [
    { "year": "1784", "title": "美国独立战争正式结束" },
    { "year": "1948", "title": "电影《一江春水向东流》创票房纪录" }
  ],
  "01-15": [
    { "year": "1809", "title": "蒲鲁东出生" },
    { "year": "1935", "title": "遵义会议召开" }
  ],
  "01-16": [
    { "year": "1581", "title": "荷兰独立" },
    { "year": "1981", "title": "我国第一座原子能反应堆改建成功" }
  ],
  "01-17": [
    { "year": "1908", "title": "慈禧太后立溥仪为帝" },
    { "year": "1945", "title": "瑞典外交官瓦伦堡失踪" }
  ],
  "01-18": [
    { "year": "1535", "title": "西班牙征服秘鲁" },
    { "year": "1919", "title": "巴黎和会召开" }
  ],
  "01-19": [
    { "year": "1853", "title": "凡尔登条约签订" },
    { "year": "1929", "title": "梁启超逝世" }
  ],
  "01-20": [
    { "year": "1924", "title": "第一次国共合作正式形成" },
    { "year": "1993", "title": "克林顿就任美国总统" }
  ],
  "01-21": [
    { "year": "1793", "title": "路易十六被处决" },
    { "year": "1924", "title": "列宁逝世" }
  ],
  "01-22": [
    { "year": "1901", "title": "英国维多利亚女王去世" },
    { "year": "1928", "title": "方志敏发动弋横起义" }
  ],
  "01-23": [
    { "year": "1368", "title": "朱元璋建立明朝" },
    { "year": "1967", "title": "中央文革小组夺取上海党政大权" }
  ],
  "01-24": [
    { "year": "1859", "title": "瓦拉几亚与摩尔达维亚联合" },
    { "year": "1984", "title": "中国首次研制成功南极考察站" }
  ],
  "01-25": [
    { "year": "1924", "title": "第一届冬奥会开幕" },
    { "year": "1956", "title": "《人民日报》创刊" }
  ],
  "01-26": [
    { "year": "1841", "title": "鸦片战争中英军占领香港" },
    { "year": "1953", "title": "美国解除对日本的占领" }
  ],
  "01-27": [
    { "year": "1842", "title": "德国作曲家韦伯逝世" },
    { "year": "1945", "title": "苏军解放奥斯威辛集中营" }
  ],
  "01-28": [
    { "year": "1596", "title": "英国探险家德雷克逝世" },
    { "year": "1986", "title": "美国挑战者号航天飞机失事" }
  ],
  "01-29": [
    { "year": "1856", "title": "英国维多利亚女王提出“欧洲协调”" },
    { "year": "1964", "title": "第一届全国人大第一次会议闭幕" }
  ],
  "01-30": [
    { "year": "1649", "title": "英国国王查理一世被处死" },
    { "year": "1933", "title": "希特勒被任命为德国总理" }
  ],
  "01-31": [
    { "year": "1916", "title": "袁世凯登基" },
    { "year": "1949", "title": "北平和平解放" }
  ],
  "02-01": [
    { "year": "1662", "title": "郑成功收复台湾" },
    { "year": "1946", "title": "印度尼西亚宣布独立" }
  ],
  "02-02": [
    { "year": "1907", "title": "俄国无产阶级政党建立" },
    { "year": "1971", "title": "我国第一座长波台建成" }
  ],
  "02-03": [
    { "year": "1873", "title": "美国发明家爱迪生发明留声机" },
    { "year": "1995", "title": "《中华人民共和国劳动法》正式施行" }
  ],
  "02-04": [
    { "year": "1861", "title": "美国南北战争爆发" },
    { "year": "1975", "title": "刘家峡水电站建成" }
  ],
  "02-05": [
    { "year": "1912", "title": "民国政府统一货币" },
    { "year": "1964", "title": "我国第一例自体肾移植手术成功" }
  ],
  "02-06": [
    { "year": "1908", "title": "上海首次试行有轨电车" },
    { "year": "1952", "title": "英国国王乔治六世逝世" }
  ],
  "02-07": [
    { "year": "1477", "title": "勃艮第战争结束" },
    { "year": "1974", "title": "我国海洋科学考察船首次出海" }
  ],
  "02-08": [
    { "year": "1902", "title": "梁启超在日本创办《新民丛报》" },
    { "year": "1979", "title": "中共中央批准为右派分子平反" }
  ],
  "02-09": [
    { "year": "1825", "title": "俄国十二月党人起义失败" },
    { "year": "1928", "title": "夏明翰就义" }
  ],
  "02-10": [
    { "year": "1763", "title": "巴黎和约签订，七年战争结束" },
    { "year": "1964", "title": "龙羊峡水电站开工" }
  ],
  "02-11": [
    { "year": "1878", "title": "《圣斯特凡诺条约》签订" },
    { "year": "1963", "title": "中央美术学院成立" }
  ],
  "02-12": [
    { "year": "1809", "title": "林肯出生" },
    { "year": "1912", "title": "清宣统皇帝溥仪宣布退位" }
  ],
  "02-13": [
    { "year": "1895", "title": "甲午战争清政府战败" },
    { "year": "1980", "title": "中国首次派团参加冬季奥运会" }
  ],
  "02-14": [
    { "year": "1876", "title": "亚历山大·格拉汉姆·贝尔申请电话专利" },
    { "year": "1912", "title": "聂耳出生" }
  ],
  "02-15": [
    { "year": "1564", "title": "伽利略出生" },
    { "year": "1904", "title": "华兴会成立" }
  ],
  "02-16": [
    { "year": "1910", "title": "同盟会分裂" },
    { "year": "1959", "title": "古巴革命胜利" }
  ],
  "02-17": [
    { "year": "1616", "title": "努尔哈赤建立后金" },
    { "year": "1963", "title": "迈克尔·乔丹出生" }
  ],
  "02-18": [
    { "year": "1294", "title": "元世祖忽必烈逝世" },
    { "year": "1861", "title": "意大利王国宣布成立" }
  ],
  "02-19": [
    { "year": "1473", "title": "哥白尼出生" },
    { "year": "2008", "title": "科索沃宣布独立" }
  ],
  "02-20": [
    { "year": "1881", "title": "奥地利作家卡夫卡出生" },
    { "year": "1985", "title": "我国首次南极科考凯旋" }
  ],
  "02-21": [
    { "year": "1848", "title": "《共产党宣言》出版" },
    { "year": "1972", "title": "美国总统尼克松访华" }
  ],
  "02-22": [
    { "year": "1732", "title": "华盛顿出生" },
    { "year": "1921", "title": "考茨基逝世" }
  ],
  "02-23": [
    { "year": "1868", "title": "美国通过宪法第14修正案" },
    { "year": "1940", "title": "杨靖宇壮烈牺牲" }
  ],
  "02-24": [
    { "year": "1881", "title": "沙俄强迫清政府签订《伊犁条约》" },
    { "year": "1991", "title": "海湾战争结束" }
  ],
  "02-25": [
    { "year": "1841", "title": "鸦片战争中清军反攻失败" },
    { "year": "1994", "title": "约旦与以色列建交" }
  ],
  "02-26": [
    { "year": "1808", "title": "法国进攻西班牙" },
    { "year": "1985", "title": "我国第一台大型电子显微镜研制成功" }
  ],
  "02-27": [
    { "year": "1844", "title": "多米尼加独立" },
    { "year": "1999", "title": "奥巴桑乔当选尼日利亚总统" }
  ],
  "02-28": [
    { "year": "1901", "title": "诺贝尔奖在巴黎首次颁发" },
    { "year": "1993", "title": "武陵源风景名胜区列入世界遗产" }
  ],
  "02-29": [
    { "year": "1936", "title": "雷诺汽车公司成立" },
    { "year": "2004", "title": "海地发生军事政变" }
  ],
  "03-01": [
    { "year": "1919", "title": "朝鲜三一运动爆发" },
    { "year": "1954", "title": "第一枚真正的氢弹试验成功" }
  ],
  "03-02": [
    { "year": "1836", "title": "得克萨斯独立" },
    { "year": "1969", "title": "协和式飞机首次试飞" }
  ],
  "03-03": [
    { "year": "1912", "title": "同盟会改组为国民党" },
    { "year": "1990", "title": "人类首次胜利横穿南极" }
  ],
  "03-04": [
    { "year": "1861", "title": "亚伯拉罕·林肯就任美国总统" },
    { "year": "1997", "title": "克林顿连任美国总统" }
  ],
  "03-05": [
    { "year": "1927", "title": "毛泽东考察湖南农民运动" },
    { "year": "1946", "title": "丘吉尔发表铁幕演说" }
  ],
  "03-06": [
    { "year": "1806", "title": "英国宣布禁止奴隶贸易" },
    { "year": "1987", "title": "我国首次颁发卫星运载火箭许可证" }
  ],
  "03-07": [
    { "year": "1876", "title": "俄国著名作家契诃夫出生" },
    { "year": "1965", "title": "美国黑人争取民权游行" }
  ],
  "03-08": [
    { "year": "1909", "title": "国际妇女节诞生" },
    { "year": "1952", "title": "我国第一次扫盲运动展开" }
  ],
  "03-09": [
    { "year": "1916", "title": "法德凡尔登战役爆发" },
    { "year": "1978", "title": "我国首次进行人工合成胰岛素" }
  ],
  "03-10": [
    { "year": "1876", "title": "贝尔发明电话" },
    { "year": "1918", "title": "苏俄首都由彼得格勒迁至莫斯科" }
  ],
  "03-11": [
    { "year": "1912", "title": "中华民国同盟会正式成立" },
    { "year": "1990", "title": "立陶宛独立" }
  ],
  "03-12": [
    { "year": "1881", "title": "土耳其国父凯末尔出生" },
    { "year": "1925", "title": "孙中山逝世" }
  ],
  "03-13": [
    { "year": "1868", "title": "日本明治维新开始" },
    { "year": "1930", "title": "美国科学家发现冥王星" }
  ],
  "03-14": [
    { "year": "1879", "title": "爱因斯坦出生" },
    { "year": "1997", "title": "重庆直辖市正式挂牌" }
  ],
  "03-15": [
    { "year": "1917", "title": "俄国二月革命爆发" },
    { "year": "1992", "title": "中国棋院成立" }
  ],
  "03-16": [
    { "year": "1908", "title": "诺贝尔物理学奖得主丁肇中出生" },
    { "year": "1988", "title": "《末代皇帝》获奥斯卡九项大奖" }
  ],
  "03-17": [
    { "year": "1861", "title": "意大利统一" },
    { "year": "1969", "title": "我国第一艘核潜艇下水" }
  ],
  "03-18": [
    { "year": "1871", "title": "巴黎公社革命爆发" },
    { "year": "1949", "title": "国民党退出大陆" }
  ],
  "03-19": [ [
    { "year": "1853", "title": "太平天国定都天京" },
    { "year": "1941", "title": "中国民主政团同盟成立" }
  ],
  "03-20": [
    { "year": "1727", "title": "牛顿逝世" },
    { "year": "1999", "title": "北约开始轰炸南联盟" }
  ],
  "03-21": [
    { "year": "1919", "title": "匈牙利苏维埃共和国成立" },
    { "year": "1955", "title": "我国首次发行新版人民币" }
  ],
  "03-22": [
    { "year": "1896", "title": "俄国波波夫发明无线电" },
    { "year": "1993", "title": "世界上第一只克隆羊多莉诞生" }
  ],
  "12-31": [
    { "year": "1916", "title": "袁世凯复辟帝制失败" },
    { "year": "1946", "title": "中国开始使用公历" }
  ]
};